[![imagenes/pythonista.png](imagenes/pythonista.png)](https://pythonista.io)

# Índices y multiíndeces.

Los índices e índices de columnas son objetos de *Pandas* que pueden ser tan simple como un listado de cadenas de caracteres o estructuras compleja de múltiples niveles.

En este capítulo se estudiarán a los objetos instanciados de las clases ```pd.Index``` y ```pd.MultiIndex```.

In [1]:
import pandas as pd
import numpy as np

## El atributo ```axes```.

Este atributo ```axes``` es una lista que contiene al índice y al índice de las columnas de un dataframe.

* El objeto ```axes[0]``` corresponde al índice del dataframe.
* El objeto ```axes[1]``` corresponde al índice de columnas del dataframe.

Los índices pueden ser de tipo ```pd.Index``` o ```pd.MultiIndex```.

**Ejemplo:**

* Se creará al dataframe ```poblacion```.

In [7]:
poblacion = pd.DataFrame({'Animal':('lobo',
                                    'coyote',
                                   'jaguar',
                                   'cerdo salvaje',
                                    'tapir',
                                    'venado',
                                    'ocelote',
                                    'puma'),
                         'Norte_I':(12,
                                   np.NAN,
                                    None,
                                    2,
                                    4,
                                    2,
                                    14,
                                    5
                                   ),
                          'Norte_II':(23,
                                    4,
                                    25,
                                    21,
                                    9,
                                    121,
                                    1,
                                    2
                                   ),
                         'Centro_I':(15,
                                    23,
                                    2,
                                    120,
                                    40,
                                    121,
                                    0,
                                    5),
                         'Sur_I':(28,
                                  46,
                                  14,
                                  156,
                                  79,
                                  12,
                                  2,
                                  np.NAN)}).set_index('Animal')

In [8]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

* Se desplegará ```poblacion.axes```.

In [9]:
poblacion.axes

[Index(['lobo', 'coyote', 'jaguar', 'cerdo salvaje', 'tapir', 'venado',
        'ocelote', 'puma'],
       dtype='object', name='Animal'),
 Index(['Norte_I', 'Norte_II', 'Centro_I', 'Sur_I'], dtype='object')]

In [10]:
poblacion.axes[0]

Index(['lobo', 'coyote', 'jaguar', 'cerdo salvaje', 'tapir', 'venado',
       'ocelote', 'puma'],
      dtype='object', name='Animal')

In [11]:
poblacion.axes[1]

Index(['Norte_I', 'Norte_II', 'Centro_I', 'Sur_I'], dtype='object')

## La clase ```pd.Index```.

Esta clase es la clase que permite crear índices simples y se instancia de esta manera.

```
pd.Index(['<índice 1>', '<índice 2>',..., '<índice n>'], name='<nombre>')
```
Donde:

* ```<índice x>``` es una cadena de caracteres correpsondiente al nombre de un índice.
* ```<nombre>``` es una cadena de caracteres para el atributo ```name``` del objeto ```pd.Index```.

**Ejemplo:**

* Se creará el objeto ```pd.Index``` con nombre ```indice```.

In [12]:
indice = pd.Index(['N_1', 'N_2', 'C', 'S'], name='Regiones')

* Se asignará ```indice``` al atributo ```poblacion.columns```.

In [13]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

In [14]:
poblacion.columns = indice

In [15]:
poblacion

Regiones        N_1  N_2    C      S
Animal
lobo           12.0   23   15   28.0
coyote          NaN    4   23   46.0
jaguar          NaN   25    2   14.0
cerdo salvaje   2.0   21  120  156.0
tapir           4.0    9   40   79.0
venado          2.0  121  121   12.0
ocelote        14.0    1    0    2.0
puma            5.0    2    5    NaN

### El atributo ```pd.Index.name```.

Este atributo contiene el nombre del objeto pd.Index.name, el cual será desplegado como parte de un índice.

* Se despegará el atributo ```name``` de ```poblacion.index```.

In [16]:
poblacion.index.name

'Animal'

In [17]:
poblacion.columns.name

'Regiones'

### El atributo ```pd.Index.values```.

Este atributo es un objeto ```np.ndarray``` que contiene los nombres de cada índice.

**Ejemplos:**

* Se desplegará el atributo ```poblacion.columns.values```.

In [18]:
poblacion.columns.values

array(['N_1', 'N_2', 'C', 'S'], dtype=object)

* Se sustituirá el valor de ```poblacion.columns.values[3]``` por la cadena ```'Sur'```.

In [19]:
poblacion.columns.values[3] = 'Sur'

In [20]:
poblacion

Regiones        N_1  N_2    C    Sur
Animal
lobo           12.0   23   15   28.0
coyote          NaN    4   23   46.0
jaguar          NaN   25    2   14.0
cerdo salvaje   2.0   21  120  156.0
tapir           4.0    9   40   79.0
venado          2.0  121  121   12.0
ocelote        14.0    1    0    2.0
puma            5.0    2    5    NaN

## La clase ```pd.MultiIndex```.

Los objetos instanciados de la clase ```pd.MultiIndex``` permiten tener más de un nivel de índices.

Estos objetos están conformados por:
* niveles (```levels```), los cuales se van desagregando conforme descienden.
* codigos de ordenamiento (```codes```), ls cuales contienen listas describiendo la distribución de los índices por nivel.
* nombres (```names```) correspondientes a cada nivel.

 ## Creación de un objeto *pd.MultiIndex*.
 
 Para la creación de objetos instanciados de ```pd.MultiIndex``` se pueden utilizar los siguientes métodos de clase:
 
 * ```pd.MultiIndex.from_arrays()```.
 * ```pd.MultiIndex.from_tuples()```.
 * ```pd.MultiIndex.from_products()```.
 * ```pd.MultiIndex.from_dataframes()```. 
 
 
 ```
 pd.MultiIndex.<método>(<objeto>, names=<interable con un nombre para cada nivel>)
 ```

**Ejemplos:**

* A continuación se creará una tupla que describe diversos índices.

In [27]:
lista = []
for zona in ('Norte_I', 'Sur_I', 'Centro_I'):
    for animal in ('jaguar', 'conejo', 'lobo'):
        lista.append((zona, animal))

In [23]:
lista = [[zona, animal] for animal in ('jaguar', 'conejo', 'lobo') for zona in ('Norte_I', 'Sur_I', 'Centro_I')]

In [28]:
tupla=tuple(lista)

In [29]:
tupla

(('Norte_I', 'jaguar'),
 ('Norte_I', 'conejo'),
 ('Norte_I', 'lobo'),
 ('Sur_I', 'jaguar'),
 ('Sur_I', 'conejo'),
 ('Sur_I', 'lobo'),
 ('Centro_I', 'jaguar'),
 ('Centro_I', 'conejo'),
 ('Centro_I', 'lobo'))

* La siguiente celda creará un objeto a partir de ```pd.MultiIndex.from_tuples```.

In [30]:
pd.MultiIndex.from_tuples(tupla, names=['zona', 'animal'])

MultiIndex([( 'Norte_I', 'jaguar'),
            ( 'Norte_I', 'conejo'),
            ( 'Norte_I',   'lobo'),
            (   'Sur_I', 'jaguar'),
            (   'Sur_I', 'conejo'),
            (   'Sur_I',   'lobo'),
            ('Centro_I', 'jaguar'),
            ('Centro_I', 'conejo'),
            ('Centro_I',   'lobo')],
           names=['zona', 'animal'])

* A continuación se crearán objetos similares utilizando  ```pd.MultiIndex.from_product```.

In [31]:
pd.MultiIndex.from_product([('Norte_I', 'Sur_I', 'Centro_I'), 
                            ('jaguar', 'conejo', 'lobo')],
                           names=['zona', 'animal'])

MultiIndex([( 'Norte_I', 'jaguar'),
            ( 'Norte_I', 'conejo'),
            ( 'Norte_I',   'lobo'),
            (   'Sur_I', 'jaguar'),
            (   'Sur_I', 'conejo'),
            (   'Sur_I',   'lobo'),
            ('Centro_I', 'jaguar'),
            ('Centro_I', 'conejo'),
            ('Centro_I',   'lobo')],
           names=['zona', 'animal'])

* Del objeto anterior se definirán las columnas de un dataframe.

In [32]:
columnas = pd.MultiIndex.from_product([('Norte_I', 'Sur_I', 'Centro_I'),
                                       ('jaguar', 'conejo', 'lobo')],
                                     names=['zona', 'animal'])

In [33]:
poblacion = pd.DataFrame([[12, 11, 24, 32, 15, 42, 35, 11, 35],
                          [23, 22, 54, 3, 34, 24, 39, 29, 11],
                          [35, 32, 67, 15, 42, 34, 46, 40, 13],
                          [33, 43, 87, 11, 61, 42, 52, 41, 15],
                          [44, 56, 98, 16, 70, 50, 57, 41, 17],
                          [53, 62, 103, 21, 74, 54, 69, 55, 23]], 
                         index=('enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio'),
                         columns=columnas)

In [34]:
poblacion

zona    Norte_I              Sur_I             Centro_I
animal   jaguar conejo lobo jaguar conejo lobo   jaguar conejo lobo
enero        12     11   24     32     15   42       35     11   35
febrero      23     22   54      3     34   24       39     29   11
marzo        35     32   67     15     42   34       46     40   13
abril        33     43   87     11     61   42       52     41   15
mayo         44     56   98     16     70   50       57     41   17
junio        53     62  103     21     74   54       69     55   23

## Indexado.

El indexado de un índice se realiza mediante corchetes. El corchete inicial corresponde al nivel superior.

In [35]:
poblacion['Norte_I']

animal   jaguar  conejo  lobo
enero        12      11    24
febrero      23      22    54
marzo        35      32    67
abril        33      43    87
mayo         44      56    98
junio        53      62   103

In [36]:
poblacion['Sur_I']['jaguar']

enero      32
febrero     3
marzo      15
abril      11
mayo       16
junio      21
Name: jaguar, dtype: int64

## El metódo ```pd.MultiIndex.droplevel()```.

Este método elimina un nivel de un MultiIndex.

```
<objeto MultiIndex>.droplevel(<nivel>)
```

In [37]:
columnas

MultiIndex([( 'Norte_I', 'jaguar'),
            ( 'Norte_I', 'conejo'),
            ( 'Norte_I',   'lobo'),
            (   'Sur_I', 'jaguar'),
            (   'Sur_I', 'conejo'),
            (   'Sur_I',   'lobo'),
            ('Centro_I', 'jaguar'),
            ('Centro_I', 'conejo'),
            ('Centro_I',   'lobo')],
           names=['zona', 'animal'])

In [38]:
columnas.droplevel(0)

Index(['jaguar', 'conejo', 'lobo', 'jaguar', 'conejo', 'lobo', 'jaguar',
       'conejo', 'lobo'],
      dtype='object', name='animal')

In [39]:
nuevas_cols = poblacion.columns.droplevel('zona')

In [40]:
nuevas_cols

Index(['jaguar', 'conejo', 'lobo', 'jaguar', 'conejo', 'lobo', 'jaguar',
       'conejo', 'lobo'],
      dtype='object', name='animal')

In [41]:
poblacion.columns = nuevas_cols

In [42]:
poblacion

animal   jaguar  conejo  lobo  jaguar  conejo  lobo  jaguar  conejo  lobo
enero        12      11    24      32      15    42      35      11    35
febrero      23      22    54       3      34    24      39      29    11
marzo        35      32    67      15      42    34      46      40    13
abril        33      43    87      11      61    42      52      41    15
mayo         44      56    98      16      70    50      57      41    17
junio        53      62   103      21      74    54      69      55    23

In [43]:
poblacion['jaguar']

animal   jaguar  jaguar  jaguar
enero        12      32      35
febrero      23       3      39
marzo        35      15      46
abril        33      11      52
mayo         44      16      57
junio        53      21      69

<p style="text-align: center"><a rel="license" href="http://creativecommons.org/licenses/by/4.0/"><img alt="Licencia Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by/4.0/80x15.png" /></a><br />Esta obra está bajo una <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Licencia Creative Commons Atribución 4.0 Internacional</a>.</p>
<p style="text-align: center">&copy; José Luis Chiquete Valdivieso. 2019.</p>